app/views/home/index.html.erb

                                    <div class="pin_insert_comma_seperated">
                                      <%= f.select(:zone, Zip.select(:zone).map(&:zone).uniq, :prompt => 'Select Zone') %>
---
SELECT "zips"."zone" FROM "zips"