app/controllers/home_controller.rb

  def index
    @session_data_all = ShopifyAPI::Shop.current
    curr_store_id = @session_data_all.id

    @compare_shop_id = Home.find_by_shopid(curr_store_id)
    @zip_zone_list = Zip.select(:zone).map(&:zone).uniq
    @zip_new_comm_sep = Zip.new
    if @compare_shop_id.nil?

      zipcontent = Zipcontent.find_by_id(10)
---
SELECT  "zipcontents".* FROM "zipcontents" WHERE "zipcontents"."id" = $1 LIMIT 1  [["id", 10]]