app/controllers/home_controller.rb

  def index
    @session_data_all = ShopifyAPI::Shop.current
    curr_store_id = @session_data_all.id

    @compare_shop_id = Home.find_by_shopid(curr_store_id)
    @zip_zone_list = Zip.select(:zone).map(&:zone).uniq
    @zip_new_comm_sep = Zip.new
    if @compare_shop_id.nil?

      zipcontent = Zipcontent.find_by_zipcount(1)

      Home.create(:heading => zipcontent.heading,
                :shopid => curr_store_id,
                :avail_msg => zipcontent.avail_msg,
                :notavail_msg => zipcontent.notavail_msg,
                :success_txt_color => zipcontent.success_txt_color,
                :fail_txt_color => zipcontent.fail_txt_color,
                :btn_color => zipcontent.btn_color,
                :btn_font_color => zipcontent.btn_font_color
        )


      names = Array.new
      @zip_list = Zip.all
---
SELECT  "homes".* FROM "homes" WHERE "homes"."shopid" = $1 LIMIT 1  [["shopid", 12911387]]
SELECT "zips"."zone" FROM "zips"
SELECT  "zipcontents".* FROM "zipcontents" WHERE "zipcontents"."zipcount" = $1 LIMIT 1  [["zipcount", 1]]
INSERT INTO "homes" ("heading", "shopid", "avail_msg", "notavail_msg", "success_txt_color", "fail_txt_color", "btn_color", "btn_font_color", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
SELECT "zips".* FROM "zips"

  def ziphome
    session_data_all = ShopifyAPI::Shop.current
    curr_store_id = session_data_all.id

    @edit_css = Home.find_by_shopid(curr_store_id)
---
SELECT  "homes".* FROM "homes" WHERE "homes"."shopid" = $1 LIMIT 1  [["shopid", 12693465]]

  def edit
    @home = Home.find_by_id(params[:id])
---
SELECT  "homes".* FROM "homes" WHERE "homes"."id" = $1 LIMIT 1  [["id", 1]]

  def update
    @home = Home.find(params[:home][:id])
    if @home.update_attributes(content_params)
---
SELECT  "homes".* FROM "homes" WHERE "homes"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "homes" SET "success_txt_color" = $1, "heading" = $2, "notavail_msg" = $3, "updated_at" = $4 WHERE "homes"."id" = $5  [["success_txt_color", "#eb12c7"], ["heading", "ZipShip Check App"], ["notavail_msg", "Ooopss shipping is not available here."], ["updated_at", "2016-05-17 10:22:06.170419"], ["id", 1]]

  def pincodeList
    @zip_new_comm_sep = Zip.new
    session_data_all = ShopifyAPI::Shop.current
    curr_store_id = session_data_all.id
    @shopZipList = Zip.where(shopid: curr_store_id)
---
SELECT "zips".* FROM "zips" WHERE "zips"."shopid" = $1  [["shopid", 12693465]]

  def import
      selected_filter_zone = params[:zone].downcase
      puts selected_filter_zone
      puts '========zone==============='

      params[:file].each do |file_name|
        file_ext = file_name.path.split('.').last
          @session_data_all = ShopifyAPI::Shop.current
          curr_store_id = @session_data_all.id
          zipcodes = Zip.all()
          zipList = Array.new
          zipCsvList = Array.new
          zipUniqueList = Array.new
          zipcodes.each do |zip|
              zipList << {"pincode": zip.pincode, "shopid": zip.shopid, "zone": zip.zone}
---
SELECT "zips".* FROM "zips"
INSERT INTO "zips" ("pincode", "shopid", "zone", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["pincode", "80001"], ["shopid", 12693465], ["zone", "[\"lucknow\"]"], ["created_at", "2016-05-30 13:09:32.634662"], ["updated_at", "2016-05-30 13:09:32.634662"]]

  def commaSeprtd
    session_data_all = ShopifyAPI::Shop.current
    curr_store_id = session_data_all.id
    zip_array = Array.new
    zip_list = Array.new
    zipUniqueList = Array.new
    zipcodes = Zip.all()
    zip_values = params[:zip][:pincode].split(',')

    zip_values.each do |pin|
      zip_array << {"pincode": pin, "shopid": curr_store_id, "zone": params[:zip][:zone]}
---
SELECT "zips".* FROM "zips"
INSERT INTO "zips" ("pincode", "shopid", "zone", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["pincode", "12345"], ["shopid", 12693465], ["zone", "lucknow"], ["created_at", "2016-05-31 11:39:45.652971"], ["updated_at", "2016-05-31 11:39:45.652971"]]

  def exportCSV
    puts params
    session_data_all = ShopifyAPI::Shop.current
    curr_store_id = session_data_all.id
    @pincodes = Zip.select("pincode").where("shopid": curr_store_id, "zone": params[:zone])
---
SELECT "zips"."pincode" FROM "zips" WHERE "zips"."shopid" = $1 AND "zips"."zone" = $2  [["shopid", 12693465], ["zone", "lucknow"]]