app/controllers/home_controller.rb

  def index
    @session_data_all = ShopifyAPI::Shop.current
    curr_store_id = @session_data_all.id

    @compare_shop_id = Home.find_by_shopid(curr_store_id)
    @zip_zone_list = Zip.select(:zone).where(:shopid => curr_store_id).map(&:zone).uniq
    @zip_new_comm_sep = Zip.new
    if @compare_shop_id.nil?

      zipcontent = Zipcontent.find_by_zipcount(1)

      Home.create(:heading => zipcontent.heading,
                :shopid => curr_store_id,
                :avail_msg => zipcontent.avail_msg,
                :notavail_msg => zipcontent.notavail_msg,
                :success_txt_color => zipcontent.success_txt_color,
                :fail_txt_color => zipcontent.fail_txt_color,
                :btn_color => zipcontent.btn_color,
                :btn_font_color => zipcontent.btn_font_color,
                :heading_color => zipcontent.heading_color,
                :btn_border_color =>  zipcontent.btn_border_color
        )


      names = Array.new
      @zip_list = Zip.where(:shopid => curr_store_id)

      @zip_list.each do |zip_list|
---
SELECT  "zips".* FROM "zips" WHERE "zips"."id" = $1 LIMIT 1  [["id", nil]]